; domain
;; Adapted from: https://github.com/josej30/Planner-Sat-Constraints
;; We use existential preconditions (exists) to remove as many parameters from the actions as possible

(define (domain logistics)

(:requirements :strips :typing :existential-preconditions) 

(:types  city location thing - object
         package vehicle - thing
         truck airplane - vehicle  
         airport - location)
  
(:predicates  (in-city ?l - location ?c - city)
              (at ?obj - thing ?l - location)
              (in ?p - package ?veh - vehicle))
  
(:action drive
         :parameters    (?t - truck ?from ?to - location)
         :precondition  (and 
                             (at ?t ?from)
                             (exists (?c - city)
                                (and (in-city ?from ?c) (in-city ?to ?c))
                              )
                         )
         :effect        (and (not (at ?t ?from))
                             (at ?t ?to)))

(:action fly
         :parameters    (?a - airplane ?from ?to - airport)
         :precondition  (at ?a ?from)
         :effect        (and (not (at ?a ?from))
                             (at ?a ?to)))

(:action load
         :parameters    (?v - vehicle ?p - package ?l - location)
         :precondition  (and (at ?v ?l)
                             (at ?p ?l))
         :effect        (and (not (at ?p ?l))
                             (in ?p ?v)))

(:action unload
         :parameters    (?v - vehicle ?p - package ?l - location)
         :precondition  (and (at ?v ?l)
                             (in ?p ?v))
         :effect        (and (not (in ?p ?v))
                             (at ?p ?l)))

)

; problem
(define (problem problem_81)

(:domain logistics)

(:objects
	obj0 obj2 - airport
	obj1 obj3 - city
	obj4 obj6 obj13 - truck
	obj5 obj7 obj8 obj12 obj14 obj16 - package
	obj9 obj10 - location
	obj11 obj15 - airplane
)

(:init
	(at obj4 obj2)
	(at obj5 obj0)
	(at obj6 obj0)
	(at obj7 obj2)
	(at obj8 obj0)
	(at obj11 obj2)
	(at obj12 obj0)
	(at obj13 obj0)
	(at obj14 obj0)
	(at obj15 obj2)
	(at obj16 obj0)
	(in-city obj0 obj1)
	(in-city obj2 obj3)
	(in-city obj9 obj3)
	(in-city obj10 obj1)
)

(:goal (and
	(at obj5 obj10)
	(at obj7 obj10)
	(at obj8 obj9)
	(at obj12 obj9)
	(at obj14 obj9)
	(at obj16 obj9)
))
)

; plan
1. (drive obj4 obj2 obj9)
   deleted: (at obj4 obj2)
   added: (at obj4 obj9)
   goals met: 0 of 6
2. (fly obj15 obj2 obj0)
   deleted: (at obj15 obj2)
   added: (at obj15 obj0)
   goals met: 0 of 6
3. (load obj11 obj7 obj2)
   deleted: (at obj7 obj2)
   added: (in obj7 obj11)
   goals met: 0 of 6
4. (fly obj11 obj2 obj0)
   deleted: (at obj11 obj2)
   added: (at obj11 obj0)
   goals met: 0 of 6
5. (drive obj13 obj0 obj10)
   deleted: (at obj13 obj0)
   added: (at obj13 obj10)
   goals met: 0 of 6
6. (drive obj4 obj9 obj2)
   deleted: (at obj4 obj9)
   added: (at obj4 obj2)
   goals met: 0 of 6
7. (drive obj6 obj0 obj10)
   deleted: (at obj6 obj0)
   added: (at obj6 obj10)
   goals met: 0 of 6
8. (fly obj15 obj0 obj2)
   deleted: (at obj15 obj0)
   added: (at obj15 obj2)
   goals met: 0 of 6
9. (load obj11 obj12 obj0)
   deleted: (at obj12 obj0)
   added: (in obj12 obj11)
   goals met: 0 of 6
10. (load obj11 obj14 obj0)
   deleted: (at obj14 obj0)
   added: (in obj14 obj11)
   goals met: 0 of 6
11. (load obj11 obj16 obj0)
   deleted: (at obj16 obj0)
   added: (in obj16 obj11)
   goals met: 0 of 6
12. (load obj11 obj8 obj0)
   deleted: (at obj8 obj0)
   added: (in obj8 obj11)
   goals met: 0 of 6
13. (unload obj11 obj7 obj0)
   deleted: (in obj7 obj11)
   added: (at obj7 obj0)
   goals met: 0 of 6
14. (fly obj11 obj0 obj2)
   deleted: (at obj11 obj0)
   added: (at obj11 obj2)
   goals met: 0 of 6
15. (drive obj13 obj10 obj0)
   deleted: (at obj13 obj10)
   added: (at obj13 obj0)
   goals met: 0 of 6
16. (drive obj6 obj10 obj0)
   deleted: (at obj6 obj10)
   added: (at obj6 obj0)
   goals met: 0 of 6
17. (fly obj15 obj2 obj0)
   deleted: (at obj15 obj2)
   added: (at obj15 obj0)
   goals met: 0 of 6
18. (unload obj11 obj12 obj2)
   deleted: (in obj12 obj11)
   added: (at obj12 obj2)
   goals met: 0 of 6
19. (unload obj11 obj14 obj2)
   deleted: (in obj14 obj11)
   added: (at obj14 obj2)
   goals met: 0 of 6
20. (unload obj11 obj16 obj2)
   deleted: (in obj16 obj11)
   added: (at obj16 obj2)
   goals met: 0 of 6
21. (unload obj11 obj8 obj2)
   deleted: (in obj8 obj11)
   added: (at obj8 obj2)
   goals met: 0 of 6
22. (fly obj11 obj2 obj0)
   deleted: (at obj11 obj2)
   added: (at obj11 obj0)
   goals met: 0 of 6
23. (load obj4 obj12 obj2)
   deleted: (at obj12 obj2)
   added: (in obj12 obj4)
   goals met: 0 of 6
24. (load obj4 obj14 obj2)
   deleted: (at obj14 obj2)
   added: (in obj14 obj4)
   goals met: 0 of 6
25. (load obj4 obj16 obj2)
   deleted: (at obj16 obj2)
   added: (in obj16 obj4)
   goals met: 0 of 6
26. (load obj4 obj8 obj2)
   deleted: (at obj8 obj2)
   added: (in obj8 obj4)
   goals met: 0 of 6
27. (load obj6 obj5 obj0)
   deleted: (at obj5 obj0)
   added: (in obj5 obj6)
   goals met: 0 of 6
28. (load obj6 obj7 obj0)
   deleted: (at obj7 obj0)
   added: (in obj7 obj6)
   goals met: 0 of 6
29. (drive obj4 obj2 obj9)
   deleted: (at obj4 obj2)
   added: (at obj4 obj9)
   goals met: 0 of 6
30. (drive obj6 obj0 obj10)
   deleted: (at obj6 obj0)
   added: (at obj6 obj10)
   goals met: 0 of 6
31. (fly obj11 obj0 obj2)
   deleted: (at obj11 obj0)
   added: (at obj11 obj2)
   goals met: 0 of 6
32. (unload obj4 obj12 obj9)
   deleted: (in obj12 obj4)
   added: (at obj12 obj9)
   goals met: 1 of 6
33. (unload obj4 obj14 obj9)
   deleted: (in obj14 obj4)
   added: (at obj14 obj9)
   goals met: 2 of 6
34. (unload obj4 obj16 obj9)
   deleted: (in obj16 obj4)
   added: (at obj16 obj9)
   goals met: 3 of 6
35. (unload obj4 obj8 obj9)
   deleted: (in obj8 obj4)
   added: (at obj8 obj9)
   goals met: 4 of 6
36. (unload obj6 obj5 obj10)
   deleted: (in obj5 obj6)
   added: (at obj5 obj10)
   goals met: 5 of 6
37. (unload obj6 obj7 obj10)
   deleted: (in obj7 obj6)
   added: (at obj7 obj10)
   goals met: 6 of 6
